lab11_php_ci/app/Controllers/Artikel.php

SELECT COUNT(*) AS `numrows`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
 LIMIT 10
---
    public function admin_index()
    {
        $title = 'Daftar Artikel (Admin)';
        $model = new \App\Models\ArtikelModel();

        $q = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';
        $page = $this->request->getVar('page') ?? 1;

        $builder = $model->table('artikel')
            ->select('artikel.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori');

        if ($q !== '') {
            $builder->like('artikel.judul', $q);
        }

        if ($kategori_id !== '') {
            $builder->where('artikel.id_kategori', $kategori_id);
        }

        $artikel = $builder->paginate(10, 'default', $page);

SELECT *
FROM `kategori`
---
            return $this->response->setJSON($data);
        } else {
            $kategoriModel = new \App\Models\KategoriModel();
            $data['kategori'] = $kategoriModel->findAll();

SELECT *
FROM `kategori`
---
    public function add()
    {
        $kategoriModel = new \App\Models\KategoriModel();
        $kategori = $kategoriModel->findAll();

SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '1'
SELECT *
FROM `kategori`
---
    public function edit($id)
    {
        $artikelModel = new ArtikelModel();
        $kategoriModel = new \App\Models\KategoriModel();

        $validation = \Config\Services::validation();
        $validation->setRules(['judul' => 'required']);

        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid) {
            $artikelModel->update($id, [
                'judul'       => $this->request->getPost('judul'),
                'isi'         => $this->request->getPost('isi'),
                'id_kategori' => $this->request->getPost('id_kategori'),
            ]);
            return redirect()->to('/admin/artikel');
        }

        $data = $artikelModel->find($id);
        $kategori = $kategoriModel->findAll();