lab11_php_ci/app/Controllers/Post.php

    public function index()
    {
        $model = new ArtikelModel();
        $data['artikel'] = $model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `artikel`
ORDER BY `id` DESC